{"keras_version": "2.0.6", "config": [{"config": {"batch_input_shape": [null, 28, 28, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "name": "conv2d_1", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "name": "conv2d_2", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "name": "conv2d_3", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "name": "conv2d_4", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "units": 50, "kernel_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "units": 225, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}